
## Terraform plan for environment: `int`

**Commit:** accbcc316082470a004e0ba5ba02d0598973643e


**API version:** 418eb0c
**CLI version:** 418eb0c
**Selfserve version:** 418eb0c
**Internal version:** 418eb0c

### Plan summary

`3 to add, 0 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
module.service.module.eventbridge.aws_iam_policy_attachment.additional_inline[0]
module.service.module.eventbridge.aws_iam_role.eventbridge[0]
```


----

<details data-gh-workflow="int-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.service.module.eventbridge.aws_iam_policy.additional_inline[0] will be created
  + resource "aws_iam_policy" "additional_inline" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "vol-app-int-batch-scheduler-inline"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "batch:SubmitJob"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-transxchange-consumer:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-system-parameter:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-resolve-payments:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-remove-read-audit:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-psv-operator-list-export:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-print:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-permit-print:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-permit-generation:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-irhp-allocate:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-general:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-ecmt-accept:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-disc-print:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-disc-generation:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-queue-community-licences:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-ntu:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-insolvency:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-insolvency-dlq:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-inbox:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-company-profile:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-process-cl:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-mark-expired-permits:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-licence-status-rules:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-last-tm-letter:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-international-goods-export:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-interim-end-date-enforcement:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-inspection-request-email:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-import-users-from-csv:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-flag-urgent-tasks:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-expire-bus-registration:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-enqueue-ch-compare:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-duplicate-vehicle-warning:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-digital-continuation-reminders:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-database-maintenance:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-precheck:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-postcheck:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-populate:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-data-retention-delete:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-create-psv-licence-surrender-task:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-company-profile-dlq:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cns:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-close-expired-windows:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-clean-up-variations:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-ch-vs-olcs-diffs:1",
                          + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-int-cancel-unsubmitted-bilateral:1",
                        ]
                      + Sid      = "batch"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "vol-app-int-batch-scheduler-inline"
        }
      + tags_all         = {
          + "Environment" = "int"
          + "Name"        = "vol-app-int-batch-scheduler-inline"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.module.eventbridge.aws_iam_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + name       = "vol-app-int-batch-scheduler"
      + policy_arn = (known after apply)
      + roles      = [
          + "vol-app-int-batch-scheduler",
        ]
    }

  # module.service.module.eventbridge.aws_iam_role.eventbridge[0] will be created
  + resource "aws_iam_role" "eventbridge" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "vol-app-int-batch-scheduler"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "vol-app-int-batch-scheduler"
        }
      + tags_all              = {
          + "Environment" = "int"
          + "Name"        = "vol-app-int-batch-scheduler"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>